app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT  "artists".* FROM "artists" WHERE (abc) LIMIT 1
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.find_by(id: params[:artist_id]) != nil
        @songs = Artist.find_by(id: params[:artist_id]).songs
      else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if params[:author_id]
      if Song.find_by(author_id: params[:author_id]) != nil
        @song = Song.find_by(author_id: params[:author_id])
      else
        flash[:alert] = "Song not found."
        redirect_to '/artists/index'
      end
    else
      @song = Song.find(params[:id])